Repository: 84000/data-translation-memory
Catalog: toh181-v4.tmx
Source language: bo
Languages: en

source: འཕགས་པ་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལྔ་བསྟན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།
en: The Noble Great Vehicle Sūtra Teaching the Five Perfections The Perfection of Generosity

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to all buddhas and bodhisattvas!

source: །འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: ཅོམ་ལྡན་འདས་མཉན་ཡོད་ན་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་མགོན་མེད་ཟས་སྦྱིན་གྱི་ཀུན་དགའ་ར་བ་ན། དགེ་སློང་སྟོང་ཉིས་བརྒྱ་ལྔ་བཅུའི་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་ཐམས་ཅད་ཀྱང་དགྲ་བཅོམ་པ། ཟག་པ་ཟད་པ། ཉོན་མོངས་པ་མེད་པ། དབང་དང་ལྡན་པར་གྱུར་པ། སེམས་ཤིན་ཏུ་རྣམ་པར་གྲོལ་བ། ཤེས་རབ་ཤིན་ཏུ་རྣམ་པར་གྲོལ་བ། ཅང་ཤེས་པ། གླང་པོ་ཆེན་པོ། བྱ་བ་བྱས་པ། བྱེད་པ་བྱས་པ། ཁུར་བོར་བ། བདག་གི་དོན་རྗེས་སུ་ཐོབ་པ། སྲིད་པར་ཀུན་ཏུ་སྦྱོར་བ་ཡོངས་སུ་ཟད་པ། ཡང་དག་པའི་ཤེས་པས་སེམས་ཤིན་ཏུ་རྣམ་པར་གྲོལ་བ། སེམས་ཅན་ཐམས་ཅད་ལ་དབང་དམ་པའི་ཕ་རོལ་ཏུ་སོན་པ་ཤ་སྟག་དང་།
en: The Blessed One was staying in the Jeta Grove, Anāthapiṇḍada’s park at Śrāvastī, attended by a great saṅgha of 1,250 monks, all of whom were worthy ones who had exhausted their defilements, were without afflictions, self-controlled, their minds liberated, and their insight liberated; were of noble birth, great elephants who had accomplished their tasks, completed their work, laid down their burden, reached their goal, and had destroyed the bonds of existence; and, due to their perfect knowledge, had liberated their minds and obtained supreme perfection in mastering all mental states.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕལ་ཆེར་གཞོན་ནུར་གྱུར་པ། སྐྱེ་བ་གཅིག་གིས་ཐོགས་པ། སེམས་ཅན་གྱི་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་སྲིད་པ་ལས་གྲོལ་བ། སྲིད་པར་སྐྱེ་བ་ཡོངས་སུ་འཛིན་པ། ཐམས་ཅད་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པ་ཤ་སྟག་དང་ཐབས་ཅིག་ཏུ་བཞུགས་སོ། །
en: He was also attended by bodhisattva great beings, most of whom were youthful, and had only a single birth remaining; in keeping with the wishes of beings they had freed themselves from existence, yet accepted to be born within existence; and all of them were progressing irreversibly toward unsurpassed and perfect awakening.

source: གཞན་ཡང་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དག་གིས་བཅོམ་ལྡན་འདས་ལ་བཀུར་སྟིར་བྱས། བླ་མར་བྱས། རི་མོར་བྱས། མཆོད་པར་བྱས་ནས། བདེ་བར་གཤེགས་པ།
en: Along with gods, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, and mahoragas, all present were venerating, respecting, honoring, and paying homage to the Blessed One.

source: འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ་བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱིས་འདི་ལྟ་སྟེ། ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་པོ་འདི་དག་ཉིད་ལས་བརྩམས་ནས་འཁོར་བཞི་པོ་དག་ལ་ཆོས་སྟོན་ཏོ།
en: As they did so, the well-gone one, the knower of the world, the unsurpassed charioteer who tames beings, the teacher of gods and humans, the blessed Buddha, taught the Dharma to all four assemblies, beginning with the six perfections themselves.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ན་མངོན་པར་འདུ་བྱེད་པ་མེད་པར་སྦྱིན་པ་སྦྱིན་པར་བྱའོ། །དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་།
en: The Blessed One said to Venerable Śāradvatīputra, “Śāradvatīputra, when bodhisattva great beings practice the perfection of generosity, that generosity must be practiced without any formative factors.”

source: ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བཅོམ་ལྡན་འདས་ནི་ཆོས་ཐམས་ཅད་ཀྱི་རྩ་བར་གྱུར་པ་ལགས།
en: Venerable Śāradvatīputra said to the Blessed One, “Blessed One, you are the source of the entire Dharma.

source: བཅོམ་ལྡན་འདས་ནི་ཆོས་ཐམས་ཅད་ཀྱི་གཙོ་བོར་གྱུར་པ་ལགས།
en: You are the chief of the entire Dharma.

source: བཅོམ་ལྡན་འདས་ནི་ཆོས་ཐམས་ཅད་ཀྱི་སྟོན་པར་གྱུར་པ་ལགས་ཏེ།
en: You are the teacher of the entire Dharma.

source: དེའི་སླད་དུ་བཅོམ་ལྡན་འདས་ལས་གང་ཐོས་ན་དགེ་སློང་རྣམས་འཛིན་པར་འགྱུར་བ་དེ་བཅོམ་ལྡན་འདས་ཉིད་ཀྱིས་དགེ་སློང་རྣམས་ལ་བཤད་དུ་གསོལ། དེ་སྐད་ཅེས་གསོལ་པ་དང་།
en: For this reason, Blessed One, please explain to the monks what they should retain when they hear it from the Blessed One.”

source: བཅོམ་ལྡན་འདས་ཅང་མི་གསུང་བར་གྱུར་ཏེ།
en: The Blessed One at first did not reply.

source: ལན་གཉིས་ཀྱི་བར་དུ་གསོལ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་ངས་ཁྱོད་ལ་བཅོལ་གྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལས་བརྩམས་ཏེ། ཁྱོད་སྤོབས་པར་གྱིས་ཤིག །
en: But when he had been requested a second time he said, “Śāradvatīputra, I have appointed you, so be inspired to speak confidently, beginning with the perfection of generosity of bodhisattva great beings.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས་བཅོམ་ལྡན་འདས་ལས་གོ་སྐབས་གནང་བ་ཐོབ་ནས་བཅོམ་ལྡན་འདས་ཀྱི་མཐུས་ཐོག་མ་ཉིད་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་འདོམས་ཤིང་རྗེས་སུ་སྟོན་ཏེ།
en: Having been given the opportunity by the Blessed One, and due to the Blessed One’s power, Venerable Śāradvatīputra then began to explain and teach about the bodhisattva great beings’ perfection of generosity as follows. “

source: བཅོམ་ལྡན་འདས་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པས་ཐོག་མ་ཉིད་དུ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་དམིགས་པར་བགྱི་ཞིང་སྦྱིན་པ་སྦྱིན་པར་བགྱིའོ།
en: Blessed One, when bodhisattva great beings practice the perfection of generosity, they should first turn their focus to the omniscient state, and then practice generosity.

source: །གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་དམིགས་པར་བགྱི་ནས་སྦྱིན་པ་སྦྱིན་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་པ་ལགས་སོ།
en: If bodhisattva great beings practice generosity while focusing on the omniscient state, those bodhisattva great beings will be upholding the perfection of generosity.

source: །བྱང་ཆུབ་སེམས་དཔའ་ལྟ་བར་ལྷུང་བས་སྦྱིན་པ་སྦྱིན་པ་ནི་མི་སྔོའི་ཉན་ཐོས་ཀྱིས་འམ། རང་སངས་རྒྱས་ཀྱི་སར་བསྔོས་པ་ནི་དེ་ལྟ་མ་ལགས་སོ།
en: Bodhisattvas do not dedicate their generosity toward the level of the hearers or the level of the solitary buddhas, who have fallen into conceptual views and who do not practice dedicating merit.

source: །དེ་ཅིའི་སླད་དུ་ཞེ་ན།
en: And why is that?

source: དེའི་འཇིགས་པ་ནི་དེ་ལགས་པར་འཚལ་བར་བགྱི་བའི་སླད་དུའོ།
en: Because they know they ought to be afraid of those states.”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་བྱམས་མའི་བུ་གང་པོས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཚེ་དང་ལྡན་པ་ཅིའི་ཕྱིར་ན་དེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་འཇིགས་པ་ཡིན་པར་ཤེས་པར་བྱ།
en: Venerable Pūrṇa Maitrāyaṇīputra said to Venerable Śāradvatīputra, “Venerable One, why is it said that bodhisattva great beings are afraid of those states?”

source: སྨྲས་པ། ཉན་ཐོས་རྣམས་དང་འབྲས་བུ་མཉམ་པར་འགྱུར་དུ་འོང་བས་ན་དེའི་ཕྱིར་དེའི་འཇིགས་པ་ཡིན་པར་ཤེས་པར་བྱའོ། །དེ་ནས་ཚེ་དང་ལྡན་པ་བྱམས་མའི་བུ་གང་པོས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Venerable Śāradvatīputra replied, “They are afraid of them because they fear arriving at the same result as the hearers.”

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སྦྱིན་པ་སྦྱིན་པ་གང་ཡིན་པ་དང་། ཉན་ཐོས་དགྲ་བཅོམ་པ་མངོན་སུམ་དུ་བྱ་བར་འདོད་པ་སྦྱིན་པ་སྦྱིན་པ་གང་ཡིན་པ་འདི་ལ་བྱེ་བྲག་ནི་ཅི་ཡོད།
en: Venerable Pūrṇa Maitrāyaṇīputra said to Venerable Śāradvatīputra, “Venerable Śāradvatīputra, what is the difference between the practice of generosity of the bodhisattvas and the practice of generosity of the hearers, who practice generosity because they seek to actualize the state of a worthy one?

source: ཐ་དད་དུ་དབྱེ་བ་ནི་གང་ཡིན།
en: How can they be differentiated?”

source: སྨྲས་པ། ཚེ་དང་ལྡན་པ་གང་པོ་ཐ་དད་དུ་དབྱེ་བ་ནི་འདི་ཉིད་ཡིན་ཏེ། གཅིག་ནི་གང་ཉན་ཐོས་ཀྱི་སར་ཡོངས་སུ་སྔོ་བར་བྱེད་ལ་ཅིག་ཤོས་ནི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་སྔོ་བར་བྱེད་པ་ཡིན་ནོ། །
en: Venerable Śāradvatīputra replied, “Venerable Pūrṇa, they can be distinguished, since one group dedicates their merit to reach omniscience, while the other dedicates it in order to reach the level of the hearers.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཚེ་དང་ལྡན་པ་དཔེར་ན་སྐྱེས་བུ་ལ་ལ་ཞིག་བདག་རྒྱལ་པོར་གྱུར་ཀྱང་ཅི་མ་རུང་སྙམ་དུ་རྒྱལ་པོའི་ས་ལ་དམིགས་ནས་སྦྱིན་པ་སྦྱིན་ལ།
en: Venerable One, to understand this, consider this analogy: One person may practice generosity out of the wish to be king, thinking, ‘How wonderful if I could be king!’

source: སྐྱེས་བུ་ཅིག་ཤོས་ནི་བདག་རྒྱལ་པོ་དེའི་ཡུལ་ན་གནས་ཀྱང་ཅི་མ་རུང་སྙམ་དུ་མངག་གཞུག་པར་ཁས་ལེན་པར་འདོད་དེ་སྦྱིན་པ་སྦྱིན་ཞིང་དེ་ལྟར་ཡོངས་སུ་སྔོ་ན།
en: And yet another person may practice generosity out of a wish to become a servant, thinking, ‘How wonderful if I could be a subject in the country of that king!’

source: སྐྱེས་བུ་དེས་སྐྱེས་བུ་སྔ་མ་དེས་དམིགས་པའི་རྒྱལ་པོའི་ས་གང་ཡིན་པ་དེ་ཉིད་ནོན་པར་ནུས་སམ།
en: Now, when the latter person dedicates his merit in that way, would that person ever come to attain the same royal level that the former person aimed for? “

source: ཚེ་དང་ལྡན་པ་གང་པོ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་དམིགས་ནས་སྦྱིན་པ་སྦྱིན་ཞིང་ཡོངས་སུ་སྔོ་ལ། ཉན་ཐོས་ཀྱི་ཐེག་པ་པ་ནི་སྦྱིན་པ་གང་སྦྱིན་པ་དེ་ཉན་ཐོས་ཀྱིས་ལ་དགྲ་བཅོམ་པ་ཉིད་དུ་ཡོངས་སུ་སྔོ་བར་བྱེད་དོ།
en: Venerable Pūrṇa, in the same way, bodhisattva great beings practice generosity and dedicate the merit with an eye to the state of omniscience, while the followers of the vehicle of the hearers practice generosity and dedicate the merit toward becoming a worthy one on the level of the hearers.

source: །དེ་ལྟར་འཕགས་པ་ཉན་ཐོས་བྱང་ཆུབ་སེམས་དཔའི་ཉེ་གནས་སུ་འགྱུར་བར་འདོད་ན།
en: In this way, one may wish to become a follower of either the noble hearers or the bodhisattvas.

source: སྐྱེས་བུ་དེས་སྦྱིན་པ་དེ་ཉིད་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་སྔོ་བར་བྱེད་པའི་མཐུ་དང་ནུས་པ་ཡོད་དམ། ཡང་ཚེ་དང་ལྡན་པ་གང་པོ་མོས་པ་གང་དང་ལྡན་པས་སྦྱིན་པ་དེ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་སྔོ་བའི་མོས་པ་དེ་ནི་མེད་ཀྱི། སྦྱིན་པ་དེ་ཉན་ཐོས་སུ་ཡོངས་སུ་སྔོ་བ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པ་དང་།
en: As such, individuals may have the power and strength to dedicate the practice of generosity toward the state of omniscience, or, Venerable Pūrṇa, they may have no interest in dedicating their generosity toward omniscience because they entertain a different interest, and in that case dedicate it toward attaining the state of a hearer.

source: ཉན་ཐོས་ཀྱི་ཐེག་པ་པ་དགྲ་བཅོམ་པའི་ས་ལ་གནས་པའི་ཐ་དད་དུ་དབྱེ་བ་ཡིན་ནོ།
en: This is how beings are distinguished between those within the vehicle of the bodhisattvas and those who remain on the level of a worthy one within the vehicle of the hearers.

source: །ཚེ་དང་ལྡན་པ་གང་པོ་དཔེར་ན་སྐྱེས་བུ་ལ་ལ་ཞིག་སྦྱིན་པ་འདིས་བདག་ཚོང་དཔོན་ནམ། ཁྱིམ་བདག་གམ་ཚངས་པར་གྱུར་ཅིག་ཅེས་སྦྱིན་པ་སྦྱིན་པ་དེ་བཞིན་དུ་ཉན་ཐོས་ཀྱི་ཐེག་པ་པའི་སྦྱིན་པར་བལྟའོ།
en: Venerable Pūrṇa, the generosity of those within the vehicle of the hearers should be viewed as being similar to someone who thinks, ‘May this merit cause me to become a merchant, a householder, or Brahmā!’ ”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་བྱམས་མའི་བུ་གང་པོས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཚེ་དང་ལྡན་པ་འདི་ནི་ངོ་མཚར་ཆེ་སྟེ།
en: Venerable Pūrṇa Maitrāyaṇīputra said to Venerable Śāradvatīputra, “Venerable One, this is amazing!

source: ཤ་ར་དྭ་ཏིའི་བུས་ཤིན་ཏུ་ལེགས་པར་སྨྲས་སོ།
en: Śāradvatīputra, you have explained it so well!

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དཔེར་ན་སྐྱེས་བུ་ལ་ལ་ཞིག་ཀཱར་ཥ་པ་ཎ་འབུམ་ཁྱེར་ཏེ། ཁྱིམ་བདག་ཕྱུག་པོ་གང་ཡང་རུང་བ་ཞིག་གི་དྲུང་དུ་སོང་ནས་འདི་སྐད་དུ། ཀཱར་ཥ་པ་ཎ་འབུམ་འདི་དག་ཁྱོད་ལ་འབུལ་ཏེ།
en: Venerable Śāradvatīputra, imagine a person who brings one hundred thousand coins to a wealthy householder and says, ‘I am offering you these one hundred thousand coins.

source: བདག་ཀྱང་ཁྱོད་ཀྱི་ཐད་ན་འདུག་ཅིང་བྱ་བ་དང་། སྦྱོར་བ་རྣམས་ལ་གཡོག་བགྱིད་དོ་ཞེས་ཟེར་བ་དེ་བཞིན་དུ།
en: I will also remain by your side and assist you with all your activities and engagements.’

source: ཚེ་དང་ལྡན་པ་ཉན་ཐོས་ཀྱི་ཐེག་པ་པའི་གང་ཟག་རྣམས་སྦྱིན་པ་སྦྱིན་ཞིང་། དེ་བཞིན་གཤེགས་པའི་ཞབས་འབྲིང་དུ་ཁས་ལེན་ཏོ།
en: Similarly, Venerable One, those who follow the vehicle of the hearers practice generosity and promise to become servants of the Thus-Gone One.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་དེ་ལྟར་སྦྱིན་པ་སྦྱིན་པར་མི་བྱེད་དེ།
en: The bodhisattva great beings, however, do not practice generosity like that.

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་དང་ཉན་ཐོས་ཀྱི་སྦྱིན་པ་སྦྱིན་པའི་ཁྱད་པར་དུ་དབྱེ་བ་ཡིན་ནོ།
en: That is the difference between the bodhisattvas’ practice of generosity and the hearers’ practice of generosity.

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དཔེར་ན་རྒྱལ་པོའི་བཙུན་མོའི་འཁོར་གྱི་བུད་མེད་གཅིག་གིས་གསེར་འབུམ་ཁྱེར་ཏེ། ཚོང་དཔོན་ནམ། དེད་དཔོན་གང་ཡང་རུང་བའི་དྲུང་དུ་སོང་ནས་འདི་སྐད་དུ། གསེར་འབུམ་འདི་དག་ཀྱང་ཁྱོད་ལ་འབུལ།
en: Venerable Śāradvatīputra, imagine if a woman in the royal harem were to carry off one hundred thousand pieces of gold and bring them to a merchant, or an officer, saying, ‘I am offering you these one hundred thousand pieces of gold.

source: བདག་ཀྱང་ཁྱོད་ཀྱི་གཡོག་བགྱིད་ཅིང་སྔར་ལྡང་བ་དང་། ཕྱིས་ཉལ་བ་དང་།
en: I will also be your servant, rising early in the morning and going to bed late at night.

source: ཁྱོད་ཅི་དགྱེས་པ་བཞིན་སྤྱོད་པར་བགྱིད་དོ་ཞེས་ཟེར་བ་དེ་བཞིན་དུ་ཚེ་དང་ལྡན་པ་ཉན་ཐོས་ཀྱི་ཐེག་པ་པའི་གང་ཟག་སྦྱིན་པ་ཡང་སྦྱིན་ཞིང་དེ་བཞིན་གཤེགས་པའི་ཉན་ཐོས་ཉིད་དུ་ཁས་ལེན་ཏོ།
en: I will do whatever makes you happy.’ Venerable One, similarly, the followers of the Hearers’ Vehicle practice generosity and declare themselves to be hearers of the Thus-Gone One.”

source: །དེ་སྐད་ཅེས་སྨྲས་པ་དང་། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས་ཚེ་དང་ལྡན་པ་བྱམས་མའི་བུ་གང་པོ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཚེ་དང་ལྡན་པ་སྦྱིན་པ་དེ་ཉིད་ཡོངས་སུ་བཏང་དུ་འདྲ་ན། གཅིག་ནི་ཉན་ཐོས་ཀྱིས་ཡོངས་སུ་འཛིན་པར་གྱུར་ལ། གཅིག་ནི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཡོངས་སུ་འཛིན་པར་གྱུར་པ་འདི་ནི་ངོ་མཚར་ཆེ་སྟེ།
en: Venerable Śāradvatīputra said to Venerable Pūrṇa Maitrāyaṇīputra, “Venerable One, it is amazing how very similar acts of generosity can lead one person to the level of a hearer and another one to the state of omniscience.

source: ཚེ་དང་ལྡན་པས་ལེགས་པར་སྨྲས་སོ།
en: Venerable One, you have explained it well.

source: །ཚེ་དང་ལྡན་པ་གང་པོ་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཐམས་ཅད་དུ་ཐབས་ལ་མཁས་པར་བལྟ་བར་བྱའོ།
en: Venerable Pūrṇa, you should understand that the bodhisattvas are rich in skillful means.”

source: །གཞན་ཡང་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས་ཚེ་དང་ལྡན་པ་བྱམས་མའི་བུ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཚེ་དང་ལྡན་པ་གང་པོ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སྦྱིན་པ་སྦྱིན་པར་འདོད་ཅིང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པས་སྦྱིན་པ་ཡོངས་སུ་གཏོང་བ་ན་ཐོག་མ་ཁོ་ནར་འདི་སྐད་དུ་སྦྱིན་པ་འདི་ལས་བྱུང་བའི་བསོད་ནམས་མངོན་པར་འདུ་བྱེད་པ་དང་། དགེ་བ་མངོན་པར་འདུ་བྱེད་པ་གང་ཡིན་པ་དེས་འཇིག་རྟེན་གྱི་ཁམས་མཐའ་ཡས་མུ་མེད་པ་དག་ན་ཐེག་པ་ལ་གསར་དུ་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་གང་དག་གནས་པ་དེ་དག་ནི་ཕྱིར་མི་ལྡོག་པ་ཉིད་དུ་གྱུར་ཅིག །
en: Venerable Śāradvatīputra continued addressing Venerable Maitrāyaṇīputra, saying, “Moreover, Venerable Pūrṇa, if bodhisattvas wish to practice generosity and wish to awaken to unsurpassed and perfect buddhahood, they should begin their practice of generosity with the wish, ‘May the merit and virtue that is created hereby cause all bodhisattvas who have newly entered this vehicle in all the limitless and endless worlds to reach the state of nonregression!

source: ཕྱིར་མི་ལྡོག་པ་གང་དག་གནས་པ་དེ་དག་ནི་མྱུར་དུ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཡོངས་སུ་རྫོགས་པར་གྱུར་ཅིག་ཅེས་བརྗོད་པར་བྱ་སྟེ།
en: And may all those who have reached the state of nonregression swiftly perfect the state of omniscience!’

source: དེ་ལྟར་བདག་ཉིད་ཀྱང་དེའི་ཁོངས་སུ་གཏོགས་པར་བྱེད་ཅིང་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ཀྱང་དགེ་བའི་རྩ་བ་རྣམས་ཀྱིས་ཡོངས་སུ་འཛིན་པར་བྱེད་དོ།
en: In this way, not only will they be included within this group, their roots of virtue will also sustain those bodhisattvas.

source: །ཇི་ལྟ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་དགེ་བའི་རྩ་བ་ཡོངས་སུ་འཛིན་ཅིང་རྗེས་སུ་སྲུང་བ་དེ་ལྟ་དེ་ལྟར་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ཉེ་བར་འགྱུར་རོ།
en: The more roots of virtue there are sustaining and protecting bodhisattvas, the closer they will be to the state of omniscience.

source: །ཇི་ལྟ་ཇི་ལྟར་དགེ་བའི་རྩ་བ་ཡོངས་སུ་སྔོ་བ་དེ་ལྟ་དེ་ལྟར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་དང་ཡང་ཉེ་བར་འགྱུར་རོ། །ཚེ་དང་ལྡན་པ་གང་པོ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྦྱིན་པ་སྦྱིན་པ་ན།
en: The more they dedicate their roots of virtue, the closer they will be to unsurpassed and perfect awakening. “

source: སྦྱིན་པ་དེ་འདི་ལྟར་བདག་གིས་ཁ་ཟས་ཀྱི་སྦྱིན་པ་འདི་ལས་སེམས་ཅན་གང་དག་མིག་ལམ་ན་སྣང་བ་དང་། གང་དག་མི་སྣང་བ་ཐམས་ཅད་ལས་སེམས་ཅན་གང་དག་ཟ་བ་དང་། ཅུང་ཟད་ཟ་བར་གྱུར་པའི་སྦྱིན་པ་དེ་ལས་གང་བདག་གིས་དགེ་བའི་རྩ་བ་ཡོངས་སུ་བཟུང་བར་གྱུར་པའི་དགེ་བའི་རྩ་བ་དེས་འཇིག་རྟེན་གྱི་ཁམས་མཐའ་ཡས་མུ་མེད་པ་དག་ན། ཐེག་པ་ལ་གསར་དུ་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་དག་གནས་པ་དེ་དག་ནི་ཕྱིར་མི་ལྡོག་པ་ཉིད་དུ་གྱུར་ཅིག །ཕྱིར་མི་ལྡོག་པ་གང་དག་གནས་པ་དེ་དག་ནི་མྱུར་དུ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཡོངས་སུ་རྫོགས་པར་གྱུར་ཅིག་ཅེས་ཡོངས་སུ་བསྔོ་བར་བྱའོ།
en: Venerable Pūrṇa, moreover, when bodhisattva great beings practice generosity, they dedicate the roots of virtue of their generosity, saying, ‘By the roots of virtue that come from this gift—a gift of sustenance that feeds, in whole or in part, all beings whether they are visible or not—may all bodhisattva great beings in all the limitless and endless worlds who have newly entered this vehicle reach the state of nonregression, and may all those who have reached the state of nonregression swiftly perfect the state of omniscience.’

source: །ཇི་ལྟ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་དགེ་བའི་རྩ་བ་ཡོངས་སུ་སྔོ་བར་བྱེད་པ་དེ་ལྟ་དེ་ལྟར་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམས་ཡོངས་སུ་འཛིན་ཅིང་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ཡང་ཉེ་བར་འགྱུར་ཏེ།
en: The more bodhisattvas are able to dedicate the roots of virtue, the more they will master the perfections and that much closer will they be to the state of omniscience.

source: གང་གི་ཚེ་སྦྱིན་པ་ཆུང་ངུ་ཡང་དཔག་ཏུ་མེད་པར་བྱེད་པ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཐབས་ལ་མཁས་པ་ཡིན་པར་རིག་པར་བྱའོ།
en: They should recognize that whenever a small act of generosity is made boundless in this manner, it is due to the skillful means of the bodhisattva great beings.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Why is that?

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དཔག་ཏུ་མེད་པའི་ཕྱིར་རོ།
en: Because the state of omniscience itself is boundless. “

source: །ཚེ་དང་ལྡན་པ་གང་པོ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྦྱིན་པ་སྦྱིན་པ་ན། བདག་གི་སྦྱིན་པ་འདི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མ་གཏོགས་པ་གཞན་དུ་རྣམ་པར་སྨིན་པར་མ་གྱུར་ཅིག་ཅེས་དེ་ལྟར་སེམས་བསྐྱེད་པར་བྱའོ།
en: Venerable Pūrṇa, moreover, when bodhisattva great beings practice generosity, they should develop the mind set upon awakening, saying, ‘May this gift of mine not ripen in any other way except for unsurpassed and perfect awakening!’

source: །གལ་ཏེ་ཡོངས་སུ་སྔོ་བར་བྱེད་ན་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ་བའི་གྲངས་སུ་འགྲོའོ། །
en: It is only when generosity is dedicated in this way that it can be reckoned to be the perfection of generosity.

source: ཅི་སྟེ་ཕྱིས་ཡུན་རིང་མོ་ཞིག་ལོན་ནས་ཡོངས་སུ་སྔོ་བར་བྱེད་ཅིང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཡིད་ལ་བྱེད་ན་ཡང་དེ་བཞིན་དུ་ཕ་རོལ་ཏུ་ཕྱིན་པའི་གྲངས་སུ་འགྲོའོ།
en: However, an act of generosity may still be reckoned to be the perfection of generosity even if it is dedicated long after it was done, provided that it is dedicated to the state of omniscience. “

source: །ཚེ་དང་ལྡན་པ་གང་པོ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའི་སྦྱིན་པ་ནི་ཉུང་ངུ་ཟིན་ཀྱང་མང་བར་རིག་པར་བྱའོ།
en: Venerable Pūrṇa, moreover, even when a bodhisattva’s act of generosity is insignificant, it should still be recognized as abundant.

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་བསྔོས་པའི་ཕྱིར་རོ།
en: That is because it is dedicated toward the state of omniscience.

source: །སྦྱིན་པ་མང་པོ་ཡང་ཉུང་ངུར་འགྱུར་བ་ཡོད་པར་རིག་པར་བྱ་སྟེ།
en: Similarly, a great act of generosity should also be recognized as insignificant.

source: འདི་ལྟར་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་མ་བསྔོས་པའི་ཕྱིར་རོ།
en: That is because it is not dedicated toward the state of omniscience.

source: །ཚེ་དང་ལྡན་པ་དེ་ཡང་གལ་ཏེ་ཕྱིས་ཡུན་རིང་མོ་ཞིག་ལོན་ནས་ཡོངས་སུ་སྔོ་བར་བྱེད་ན་ཡང་སྦྱིན་པའི་སྒྲ་བོར་ཏེ།
en: Venerable One, furthermore, even if an act of generosity is dedicated long after it was done, it is still called the perfection of generosity, even though it may no longer be called an act of generosity. “

source: སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒྲ་ཐོབ་པར་འགྱུར་རོ། །ཚེ་དང་ལྡན་པ་གང་པོ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་འཁོར་བ་ཐོག་མ་མེད་པ་ནས་འཁོར་བ་ན།
en: Venerable Pūrṇa, bodhisattva great beings who circle in saṃsāra without beginning may practice generosity, and yet fail to utter the word ‘omniscience.’

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཡང་དག་པར་མ་བརྗོད་པར་སྦྱིན་པ་བྱིན་པ་གང་ཡིན་པ་དེ་ཡང་བྱང་ཆུབ་སེམས་དཔས་ཐབས་མཁས་པ་ལ་བརྟེན་ནས་ཕ་རོལ་ཏུ་ཕྱིན་པར་ཡོངས་སུ་སྔོ་ཞིང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་དམིགས་པར་བྱེད་ན་བྱང་ཆུབ་སེམས་དཔའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡིན་པར་རིག་པར་བྱའོ།
en: If they nonetheless employ skillful means to dedicate their generosity toward the perfections, and focus on the state of omniscience, their generosity should indeed be recognized as the perfection of generosity of the bodhisattvas.”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་བྱམས་མའི་བུ་གང་པོས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཚེ་དང་ལྡན་པ་ཅི་འདི་ཁྱོད་ཉིད་ཀྱི་སྤོབས་པ་ཡིན་ནམ་འོན་ཏེ་བཅོམ་ལྡན་འདས་ཀྱི་བྱིན་གྱི་རླབས་ཡིན་སྨྲས་པ།
en: Venerable Pūrṇa Maitrāyaṇīputra asked Venerable Śāradvatīputra, “Venerable One, please tell me, are you this eloquent on your own accord or is it due to the blessing of the Blessed One?”

source: ཚེ་དང་ལྡན་པ་བདག་གི་སྤོབས་པ་གང་ཡིན་པ་འདི་ནི། དེ་བཞིན་གཤེགས་པའི་བྱིན་གྱི་རླབས་ཡིན་ནོ།
en: Śāradvatīputra replied, “Whatever eloquence I may possess, Venerable One, it is due to the blessing of the Thus-Gone One.

source: །ཚེ་དང་ལྡན་པ་གང་པོ་འདི་ལ་འཇིག་རྟེན་གྱི་ཁམས་དཔག་ཏུ་མེད། གྲངས་མེད། ཚད་མེད་པ་དག་ན་སེམས་ཅན་གང་དག་གནས་པ་དེ་དག་དགྲ་བཅོམ་པའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱ་བར་འདོད་པའི་ཕྱིར་བསྐལ་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དུ་སོ་སོའི་སྐྱེ་བོ་རྣམས་སམ། ཉན་ཐོས་རྣམས་སམ། རང་སངས་རྒྱས་རྣམས་ལ་སྦྱིན་པ་བྱིན་ལ།
en: Venerable Pūrṇa, say that all beings living in the boundless, countless, and limitless worlds, wishing for the result of a worthy one, were to practice generosity toward ordinary beings, hearers, and solitary buddhas for as many eons as there are grains of sand in the Ganges.

source: སྦྱིན་པ་དེ་ཡང་བྱང་ཆུབ་སེམས་དཔས་བསམས་ཏེ། བསམས་ནས་ཀྱང་འདི་སྐད་དུ་སྦྱིན་པ་འདི་ལ་རྗེས་སུ་ཡི་རང་ངོ་ཞེས་ཟེར་ཞིང་།
en: Bodhisattvas would reflect on that and declare, ‘I rejoice in this generosity!’

source: དེ་ལྟར་ཡོངས་སུ་གཏོང་བ་རྣམས་ཀྱི་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་རྗེས་སུ་ཡི་རང་བ་དང་ལྡན་པའི་བསོད་ནམས་བྱ་བའི་དངོས་པོ་ཡོད་ལ།
en: When bodhisattvas rejoice in those who give in this manner, it creates a mass of merit.

source: རྗེས་སུ་ཡི་རང་ནས་དགེ་བའི་རྩ་བ་དེ་འདི་ལྟར་ཡོངས་སུ་སྔོ་བར་བྱེད་དེ། རྗེས་སུ་ཡི་རང་བ་དང་ལྡན་པའི་དགེ་བའི་རྩ་བ་འདིས་འཇིག་རྟེན་གྱི་ཁམས་མཐའ་ཡས་མུ་མེད་པ་དག་ན། ཐེག་པ་ལ་གསར་དུ་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་གང་དག་གནས་པ་དེ་དག་ནི་ཕྱིར་མི་ལྡོག་པ་ཉིད་དུ་གྱུར་ཅིག །ཕྱིར་མི་ལྡོག་པ་གང་དག་གནས་པ་དེ་དག་ནི་མྱུར་དུ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཡོངས་སུ་རྫོགས་པར་གྱུར་ཅིག་ཅེ་ན།
en: After rejoicing, they would then dedicate the merit in this manner: ‘By means of these roots of virtue from having rejoiced, may all bodhisattva great beings in all the limitless and endless worlds who have newly entered this vehicle reach the state of nonregression, and may all those who have reached the state of nonregression swiftly perfect the state of omniscience.’

source: རྗེས་སུ་ཡི་རང་བ་དང་ལྡན་པའི་དགེ་བའི་རྩ་བ་དེ་དེ་ལྟར་ཡོངས་སུ་སྔོ་བར་བྱེད་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་མྱུར་དུ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཡོངས་སུ་རྫོགས་པར་འགྱུར་ཏེ།
en: The bodhisattvas who in this manner dedicated the roots of virtue created by rejoicing would swiftly perfect the state of omniscience.

source: དེ་ལ་སེམས་ཅན་ཡོངས་སུ་གཏོང་བར་བྱེད་པ་དེ་དག་གི་བསོད་ནམས་མངོན་པར་འདུ་བྱེད་པ་གང་ཡིན་པ་དགེ་བའི་རྩ་བ་སྔ་མ་དེ་ནི། བྱང་ཆུབ་སེམས་དཔའི་རྗེས་སུ་ཡི་རང་བ་དང་ལྡན་པའི་སེམས་ལ་བརྒྱའི་ཆར་ཡང་ཉེ་བར་མི་འགྲོའོ།
en: Comparatively, the roots of virtue that were created by the merit of those beings who at first performed the generosity would not constitute even one percent of the roots of virtue created by the bodhisattvas’ thought to rejoice.
